[
  {
    "slug": "the-queen-new-york-1977",
    "bandName": "The Queen",
    "city": "New York",
    "year": "1977",
    "date": "2019-01-22",
    "venue": "Madison Square Garden",
    "collectionPointMap": "map-the-queen-new-york-1977.png",
    "collectionPoint": "4 Pennsylvania Plaza, New York, NY 10001, USA",
    "collectionTime": "14:30",
    "originalDate": "1977-02-05",
    "capacity": 3000,
    "description": "Few bands embodied the pure excess of the '70s like Queen. Embracing the exaggerated pomp of prog rock and heavy metal, as well as vaudevillian music hall, the British quartet delved deeply into camp and bombast, creating a huge, mock-operatic sound with layered guitars and overdubbed vocals. Queen's music was a bizarre yet highly accessible fusion of the macho and the fey. For years, their albums boasted the motto \"no synthesizers were used on this record,\" signaling their allegiance with the legions of post-Led Zeppelin hard rock bands. But vocalist Freddie Mercury brought an extravagant sense of camp to Queen, pushing them toward kitschy humor and pseudo-classical arrangements, as epitomized on their best-known song, \"Bohemian Rhapsody.\" Mercury, it must be said, was a flamboyant bisexual who managed to keep his sexuality in the closet until his death from AIDS in 1991. Through his legendary theatrical performances, Queen became one of the most popular bands in the world in the mid-'70s; in England, they remained second only to the Beatles in popularity and collectibility in the '90s. Despite their enormous popularity, Queen were never taken seriously by rock critics -- an infamous Rolling Stone review labeled their 1979 album Jazz as \"fascist.\" In spite of such harsh criticism, the band's popularity rarely waned; even in the late '80s, the group retained a fanatical following except in America. In the States, their popularity peaked in the early '80s, just as they finished nearly a decade's worth of extraordinarily popular records. And while those records were never praised, they sold in enormous numbers, and traces of Queen's music could be heard in several generations of hard rock and metal bands in the next two decades, from Metallica to Smashing Pumpkins.",
    "image": "the-queen.jpg",
    "price": "1156.00"
  },
  {
    "slug": "jimi-hendrix-berkeley-1970",
    "bandName": "Jimi Hendrix",
    "city": "Berkeley",
    "year": "1970",
    "date": "2019-02-11",
    "venue": "Berkeley College Community Theatre",
    "collectionPointMap": "map-jimi-hendrix-berkeley-1970.png",
    "collectionPoint": "1900-1940 Allston Way Berkeley, CA 94704, USA",
    "collectionTime": "14:30",
    "originalDate": "1970-05-30",
    "capacity": 1200,
    "description": "In his brief four-year reign as a superstar, Jimi Hendrix expanded the vocabulary of the electric rock guitar more than anyone before or since. Hendrix was a master at coaxing all manner of unforeseen sonics from his instrument, often with innovative amplification experiments that produced astral-quality feedback and roaring distortion. His frequent hurricane blasts of noise and dazzling showmanship -- he could and would play behind his back and with his teeth and set his guitar on fire -- has sometimes obscured his considerable gifts as a songwriter, singer, and master of a gamut of blues, R&B, and rock styles.\n\nWhen Hendrix became an international superstar in 1967, it seemed as if he'd dropped out of a Martian spaceship, but in fact he'd served his apprenticeship the long, mundane way in numerous R&B acts on the chitlin circuit. During the early and mid-'60s, he worked with such R&B/soul greats as Little Richard, the Isley Brothers, and King Curtis as a backup guitarist. Occasionally he recorded as a session man (the Isley Brothers' 1964 single \"Testify\" is the only one of these early tracks that offers even a glimpse of his future genius). But the stars didn't appreciate his show-stealing showmanship, and Hendrix was straitjacketed by sideman roles that didn't allow him to develop as a soloist. The logical step was for Hendrix to go out on his own, which he did in New York in the mid-'60s, playing with various musicians in local clubs, and joining white blues-rock singer John Hammond, Jr.'s band for a while.",
    "image": "jimi-hendrix.jpg",
    "price": "1253.00"
  },
  {
    "slug": "the-beach-boys-long-beach-1961",
    "bandName": "The Beach Boys",
    "city": "Long Beach",
    "year": "1961",
    "date": "2019-03-01",
    "venue": "Long Beach Auditorium",
    "collectionPointMap": "map-the-beach-boys-long-beach-1961.png",
    "collectionPoint": "Auditorium, 2800 Snowden Ave, Long Beach, CA 90815, USA",
    "collectionTime": "14:00",
    "originalDate": "1961-12-31",
    "capacity": 1800,
    "description": "Beginning their career as the most popular surf band in the nation, the Beach Boys finally emerged by 1966 as America's preeminent pop group, the only act able to challenge (for a brief time) the overarching success of the Beatles with both mainstream listeners and the critical community. From their 1961 debut with the regional hit \"Surfin',\" the three Wilson brothers -- Brian, Dennis, and Carl -- plus cousin Mike Love and friend Al Jardine constructed the most intricate, gorgeous harmonies ever heard from a pop band. With Brian's studio proficiency growing by leaps and bounds during the mid-'60s, the Beach Boys also proved one of the best-produced groups of the '60s, exemplified by their 1966 peak with the Pet Sounds LP and the number one single \"Good Vibrations.\" Though Brian's escalating drug use and obsessive desire to trump the Beatles (by recording the perfect LP statement) eventually led to a nervous breakdown after he heard Sgt. Pepper's Lonely Hearts Club Band, the group soldiered on long into the '70s and '80s, with Brian only an inconsistent participant. The band's post-1966 material is often maligned (if it's recognized at all), but the truth is the Beach Boys continued to make great music well into the '70s. Displayed best on 1970's Sunflower, each member revealed individual talents never fully developed during the mid-'60s -- Carl became a solid, distinctive producer and Brian's replacement as nominal bandleader, Mike continued to provide a visual focus as the frontman for live shows, and Dennis developed his own notable songwriting talents. Though legal wranglings and marginal oldies tours during the '90s often obscured what made the Beach Boys great, the band's unerring ability to surf the waves of commercial success and artistic development during the '60s made them America's first, best rock band.",
    "image": "beach-boys.jpg",
    "price": "1180.00"
  },
  {
    "slug": "fleetwood-mac-st-luis-1979",
    "bandName": "Fleetwood Mac",
    "city": "St. Luis",
    "year": "1979",
    "date": "2019-04-30",
    "venue": "Checkerdome",
    "collectionPointMap": "map-fleetwood-mac-st-luis-1979.png",
    "collectionPoint": "1030 Highlands Plaza Dr St. Louis, MO 63110, USA",
    "collectionTime": "14:00",
    "originalDate": "1979-11-05",
    "capacity": 1950,
    "description": "While most bands undergo a number of changes over the course of their careers, few groups experienced such radical stylistic changes as Fleetwood Mac. Initially conceived as a hard-edged British blues combo in the late '60s, the band gradually evolved into a polished pop/rock act over the course of a decade. Throughout all of their incarnations, the only consistent members of Fleetwood Mac were drummer Mick Fleetwood and bassist John McVie -- the rhythm section that provided the band with its name. Ironically, they had the least influence over the musical direction of the band. Originally, guitarists Peter Green and Jeremy Spencer provided the band with its gutsy, neo-psychedelic blues-rock sound, but as both guitarists descended into mental illness, the group began moving toward pop/rock with the songwriting of pianist Christine McVie. By the mid-'70s, Fleetwood Mac had relocated to California, where they added the soft rock duo of Lindsey Buckingham and Stevie Nicks to their lineup. Obsessed with the meticulously arranged pop of the Beach Boys and the Beatles, Buckingham helped the band become one of the most popular groups of the late '70s. Combining soft rock with the confessional introspection of singer/songwriters, Fleetwood Mac created a slick but emotional sound that helped 1977's Rumours become one of the biggest-selling albums of all time. The band retained its popularity through the early '80s, when Buckingham, Nicks, and Christine McVie all began pursuing solo careers. The band reunited for one album, 1987's Tango in the Night, before splintering in the late '80s. Buckingham left the group initially, but the band decided to soldier on, releasing one other album before Nicks and McVie left the band in the early '90s, hastening the group's commercial decline.",
    "image": "fleetwood-mac.jpg",
    "price": "2194.00"
  },
  {
    "slug": "joy-division-london-1979",
    "bandName": "Joy Division",
    "city": "London",
    "year": "1979",
    "date": "2019-05-17",
    "venue": "Acklam Hall",
    "collectionPointMap": "map-joy-division-london-1979.png",
    "collectionPoint": "57 Acklam Rd London W10 5YU, UK",
    "collectionTime": "13:30",
    "originalDate": "1979-05-17",
    "capacity": 1650,
    "description": "Formed in the wake of the punk explosion in England, Joy Division became the first band in the post-punk movement by later emphasizing not anger and energy but mood and expression, pointing ahead to the rise of melancholy alternative music in the '80s. Though the group's raw initial sides fit the bill for any punk band, Joy Division later incorporated synthesizers (taboo in the low-tech world of '70s punk) and more haunting melodies, emphasized by the isolated, tortured lyrics of its lead vocalist, Ian Curtis. While the British punk movement shocked the world during the late '70s, Joy Division's quiet storm of musical restraint and emotive power proved to be just as important to independent music in the 1980s.",
    "image": "joy-division.jpg",
    "price": "1112.00"
  },
  {
    "slug": "nirvana-cork-1991",
    "bandName": "Nirvana",
    "city": "Cork",
    "year": "1991",
    "date": "2019-06-21",
    "venue": "Cavern Club",
    "collectionPointMap": "map-nirvana-cork-1991.png",
    "collectionPoint": "29 South Main Street, Centre, Cork City, Co. Cork, Ireland",
    "collectionTime": "13:00",
    "originalDate": "1991-08-20",
    "capacity": 2300,
    "description": "Prior to Nirvana, alternative music was consigned to specialty sections of record stores, and major labels considered it to be, at the very most, a tax write-off. After the band's second album, 1991's Nevermind, nothing was ever quite the same, for better and for worse. Nirvana popularized punk, post-punk, and indie rock, unintentionally bringing them into the American mainstream like no other band to date. While their sound was equal parts Black Sabbath (as learned by fellow Washington underground rockers the Melvins) and Cheap Trick, Nirvana's aesthetics were strictly indie rock. They covered Vaselines songs, they revived new wave cuts by Devo, and leader Kurt Cobain relentlessly pushed his favorite bands -- whether it was the art punk of the Raincoats or the country-fried hardcore of the Meat Puppets -- as if his favorite records were always more important than his own music.",
    "image": "nirvana.jpg",
    "price": "1666.60"
  },
  {
    "slug": "simon-and-garfunkel-new-york-1981",
    "bandName": "Simon and Garfunkel",
    "city": "New York",
    "year": "1981",
    "date": "2019-07-12",
    "venue": "Central Park",
    "collectionPointMap": "map-simon-and-garfunkel-new-york-1981.png",
    "collectionPoint": "79th St Transverse New York, NY 10024, USA",
    "collectionTime": "13:00",
    "originalDate": "1981-09-19",
    "capacity": 2400,
    "description": "The most successful folk-rock duo of the 1960s, Paul Simon and Art Garfunkel crafted a series of memorable hit albums and singles featuring their choirboy harmonies, ringing acoustic and electric guitars, and Simon's acute, finely wrought songwriting. The pair always inhabited the more polished end of the folk-rock spectrum and was sometimes criticized for a certain collegiate sterility. Many also feel that Simon, as both a singer and songwriter, didn't truly blossom until he began his own hugely successful solo career in the 1970s. But the best of S&G's work can stand among Simon's best material, and the duo did progress musically over the course of their five albums, moving from basic folk-rock productions into Latin rhythms and gospel-influenced arrangements that foreshadowed Simon's eclecticism on his solo albums.",
    "image": "simon-and-garfunkel.jpg",
    "price": "1121.00"
  },
  {
    "slug": "stone-temple-irvine-2012",
    "bandName": "Stone Temple Pilots",
    "city": "Irvine",
    "year": "2012",
    "date": "2019-08-08",
    "venue": "Verizon Wireless Amphitheater",
    "collectionPointMap": "map-stone-temple-irvine-2012.png",
    "collectionPoint": "8808 Irvine Center Drive Irvine, CA 92618",
    "collectionTime": "13:30",
    "originalDate": "2012-09-22",
    "capacity": 4100,
    "description": "With the release of debut album Core in 1992, Stone Temple Pilots immediately achieved what all bands crave: a devoted fan base for life. The San Diego-based four-piece captured the zeitgeist at the apex of the so-called “grunge” era, but quickly distinguished themselves as a band beholden to no trend. Boasting the inimitable riffs of guitarist Dean DeLeo, the propulsive rhythm section of bassist Robert DeLeo and drummer Eric Kretz, and the charismatic baritone of frontman Scott Weiland, STP dominated airwaves, video playlists and the charts alike. Buoyed by Billboard-charting singles “Sex Type Thing,” “Plush,” “Wicked Garden” and “Creep,” Core sold eight million copies in the United States alone, while “Plush” nabbed the 1994 Grammy for Best Hard Rock Performance and the band took home Best New Artist at the 1993 MTV Music Awards.",
    "image": "stone-temple-pilots.jpg",
    "price": "1354.00"
  },
  {
    "slug": "the-beatles-new-york-1965",
    "bandName": "The Beatles",
    "city": "New York",
    "year": "1965",
    "date": "2019-09-01",
    "venue": "Shea Stadium",
    "collectionPointMap": "map-the-beatles-new-york-1965.png",
    "collectionPoint": "119-125 Roosevelt Ave Corona, NY 11368, USA",
    "collectionTime": "13:30",
    "originalDate": "1965-18-15",
    "capacity": 1400,
    "description": "The Beatles recorded together for a little over seven years. Between October 1962 and May 1970, they released thirteen albums and a number of tracks issued on standalone singles. The catalogue created in that short period has sold more than that of any other group in history and its commercial success continues - the world’s best selling album during the first decade of the 21st century was a collection of The Beatles’ chart-topping singles called 1. But the group’s significance stems not just from huge sales figures. Their music has inspired generation upon generation of musicians, songwriters and producers. As Mark Ronson put it: ‘Everything we take for granted - they absolutely invented it.’ Tom Petty was a teenager during the years The Beatles’ records appeared in quick succession: ‘They were just out in front. There was The Beatles …and then there was everyone else. And everyone else could be great, but The Beatles were leading the way and that’s just irrefutably true.’",
    "image": "the-beatles.jpg",
    "price": "1221.00"
  },
  {
    "slug": "the-doors-miami-1969",
    "bandName": "The Doors",
    "city": "Miami",
    "year": "1969",
    "date": "2019-10-23",
    "venue": "Dinner Key auditorium",
    "collectionPointMap": "map-the-doors-miami-1969.png",
    "collectionPoint": "3400-3466 SW 27th Ave Miami, FL 33133, USA",
    "collectionTime": "13:30",
    "originalDate": "1969-03-01",
    "capacity": 2330,
    "description": "The Doors, one of the most influential and controversial rock bands of the 1960s, were formed in Los Angeles in 1965 by UCLA film students Ray Manzarek, keyboards, and Jim Morrison, vocals; with drummer John Densmore and guitarist Robby Krieger. The group never added a bass player, and their sound was dominated by Manzarek's electric organ work and Morrison's deep, sonorous voice, with which he sang and intoned his highly poetic lyrics. The group signed to Elektra Records in 1966 and released its first album, The Doors, featuring the hit \"Light My Fire,\" in 1967.",
    "image": "the-doors.jpg",
    "price": "1248.00"
  },
  {
    "slug": "ramones-davis-1979",
    "bandName": "The Ramones",
    "city": "Davis",
    "year": "1979",
    "date": "2019-11-21",
    "venue": "University of California",
    "collectionPointMap": "map-ramones-davis-1979.png",
    "collectionPoint": "1 Shields Ave, Davis, CA 95616, USA",
    "collectionTime": "13:00",
    "originalDate": "1979-10-26",
    "capacity": 2340,
    "description": "The Ramones were the first punk rock band. Other bands, such as the Stooges and the New York Dolls, came before them and set the stage and aesthetic for punk, and bands that immediately followed, such as the Sex Pistols, made the latent violence of the music more explicit, but the Ramones crystallized the musical ideals of the genre. By cutting rock & roll down to its bare essentials -- four chords; a simple, catchy melody; and irresistibly inane lyrics -- and speeding up the tempo considerably, the Ramones created something that was rooted in early '60s, pre-Beatles rock & roll and pop but sounded revolutionary. Since their breakthrough was theoretical as well as musical, they comfortably became the leaders of the emerging New York punk rock scene. While their peers such as Patti Smith, Television, Talking Heads, and Richard Hell all were more intellectual and self-consciously artistic than the Ramones, they nevertheless appealed to the same mentality because of the way they turned rock conventions inside out and celebrated kitschy pop culture with stylized stupidity. The band's first four albums set the blueprint for punk, especially American punk and hardcore, for the next two decades. And the Ramones themselves were major figures for the next two decades, playing essentially the same music without changing their style much at all. Although some punk diehards -- including several of their peers -- would have claimed the band's long career wound up undercutting the ideals the band originally stood for, the Ramones always celebrated not just the punk aesthetic, but the music itself.",
    "image": "the-ramones.jpg",
    "price": "1148.00"
  },
  {
    "slug": "soundgarden-detroit-2017",
    "bandName": "Soundgarden",
    "city": "Detroit",
    "year": "2017",
    "date": "2019-12-10",
    "venue": "Fox Theatre",
    "collectionPointMap": "map-soundgarden-detroit-2017.png",
    "collectionPoint": "2211 Woodward Ave, Detroit, MI 48201, USA",
    "collectionTime": "13:30",
    "originalDate": "2017-05-17",
    "capacity": 2140,
    "description": "Soundgarden made a place for heavy metal in alternative rock. Their fellow Seattle rockers Green River may have spearheaded the grunge sound, but they relied on noise rock in the vein of the Stooges. Similarly, Jane's Addiction were too fascinated with prog rock and performance art to appeal to a wide array of metal fans. Soundgarden, however, developed directly out of the grandiose blues-rock of Led Zeppelin and the sludgy, slow riffs of Black Sabbath. Which isn't to say they were a straight-ahead metal band. Soundgarden borrowed the D.I.Y. aesthetics of punk, melding their guitar-driven sound with an intelligence and ironic sense of humor that was indebted to the American underground of the mid-'80s. Furthermore, the band rarely limited itself to simple, pounding riffs, often making detours into psychedelia. But the group's key sonic signatures -- the gutsy wail of vocalist Chris Cornell and the winding riffs of guitarist Kim Thayil -- were what brought them out of the underground. Not only were they one of the first groups to record for the legendary Seattle indie Sub Pop, but they were the first grunge band to sign to a major label. In fact, most critics expected Soundgarden to be the band that broke down the doors for alternative rock, not Nirvana. However, the group didn't experience an across-the-board success until 1994, when Superunknown became a number one hit.",
    "image": "soundgarden.jpg",
    "price": "1100.00"
  }
]
